UpperLimit Property
 Get or Set the Upper Limit of the Room.
  Namespace:   Autodesk.Revit.DB.Architecture
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public Level UpperLimit { get; set; }
  Visual Basic
Public Property UpperLimit As Level
	Get
	Set
  Visual C++
public:
property Level^ UpperLimit {
	Level^ get ();
	void set (Level^ value);
}
 Remarks
 This property is used to get or set the Upper Limit of the Room.
 See Also
  Room Class
  Autodesk.Revit.DB.Architecture Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →